# Challenge: Connecting Python to SQL

_In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:_

## 1: Establish a Connection Between Python and the Sakila Database

_Establish a connection between Python and the Sakila database._

In [11]:
import pandas as pd
import numpy as np
import pymysql
pd.set_option('display.max_columns', None)
from sqlalchemy import create_engine, text
import config  # To get the password without showing the input

In [2]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + config.password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [10]:
with engine.connect() as connection:
    query = text('SELECT * FROM rental')
    result = connection.execute(query)
    rental = pd.DataFrame(result.all())

rental

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

## 2: Function rentals_month

_Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:_

- _engine: an object representing the database connection engine to be used to establish a connection to the Sakila database._
- _month: an integer representing the month for which rental data is to be retrieved._
- _year: an integer representing the year for which rental data is to be retrieved._

_The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame._

In order to retrieve rental data for a specified month and year from the Sakila database and return it as a Pandas DataFrame, let's derfine a function:

In [32]:
def rentals_month(engine, month: int, year: int):
    """
    This function retrieves the rental data from the Sakila database for the specified month and year.
    The execution will return results as a Pandas DataFrame.
    
    Parameters:
    - engine: SQLAlchemy engine object. An engine object manages the connection to the database.
    - month: integer, numeric value representing the month for which the rental data is required (1-12).
    - year: integer, numeric value representing the year for which the rental data is required.
    
    Returns:
    - A pandas DataFrame containing the rental data for the specified month and year.
    """
    with engine.connect() as connection:
        # SQL query to retrieve rental data for the specified month and year. 
        # The query = text("""...""") will reference :month and :year as placeholders for the parameters.
        query = text("""
            SELECT rental_id, rental_date, customer_id, return_date, staff_id, inventory_id
            FROM rental
            WHERE MONTH(rental_date) = :month AND YEAR(rental_date) = :year
        """)
        # Execute the query and fetch the data. Notice that to pass the month and year as a dictionary.
        result = connection.execute(query, {'month': month, 'year': year})
        # Convert the result to a Pandas DataFrame
        rental_data = pd.DataFrame(result.all(), columns=result.keys())
    
    return rental_data

In [17]:
# Testing the Function:
may_rentals = rentals_month(engine, 5, 2005)
may_rentals.head()

,rental_id,rental_date,customer_id,return_date,staff_id,inventory_id
0,1,2005-05-24 22:53:30,130,2005-05-26 22:04:30,1,367
1,2,2005-05-24 22:54:33,459,2005-05-28 19:40:33,1,1525
2,3,2005-05-24 23:03:39,408,2005-06-01 22:12:39,1,1711
3,4,2005-05-24 23:04:41,333,2005-06-03 01:43:41,2,2452
4,5,2005-05-24 23:05:21,222,2005-06-02 04:33:21,1,2079

In [18]:
june_rentals = rentals_month(engine, 6, 2005)
june_rentals.head()

,rental_id,rental_date,customer_id,return_date,staff_id,inventory_id
0,1158,2005-06-14 22:53:33,416,2005-06-18 21:37:33,2,1632
1,1159,2005-06-14 22:55:13,516,2005-06-17 02:11:13,1,4395
2,1160,2005-06-14 23:00:34,239,2005-06-18 01:58:34,2,2795
3,1161,2005-06-14 23:07:08,285,2005-06-21 17:12:08,1,1690
4,1162,2005-06-14 23:09:38,310,2005-06-23 22:00:38,1,987

## 3: Function rental_count_month

_Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year._

_The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005"._

_Hint: Consider making use of pandas groupby()_

This function will take the DataFrame provided by rentals_month and return a new DataFrame containing the number of rentals made by each customer in the selected month and year:

In [33]:
def rental_count_month(rental_data, month: int, year: int):
    """
    Takes a DataFrame of rental data as input and returns a new DataFrame containing 
    the number of rentals made by each customer_id during the specified month and year.
    The month and year should be passed as numeric parameters.

    Paramenters:
    - df: DataFrame of rental data
    - month: integer, numeric value of the month (1-12)
    - year: integer, numeric value of the year 
    
    Returns:
    - rentals_by_customer: DataFrame containing customer_id and rental count
    """
    # Group the data by customer_id and count the number of rentals for each customer
    rental_counts = rental_data.groupby('customer_id').size().reset_index(name=f'rentals_{str(month).zfill(2)}_{year}')
    
    return rental_counts

In [22]:
# Testing the Function:
may_rental_counts = rental_count_month(may_rentals, 5, 2005)
may_rental_counts.head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [24]:
june_rental_counts = rental_count_month(june_rentals, 6, 2005)
june_rental_counts.head()

   customer_id  rentals_06_2005
0            1                7
1            2                1
2            3                4
3            4                6
4            5                5

## 4. Function compare_rentals

_Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months._

This function will take two DataFrames containing the number of rentals made by each customer in different months and years, and return a combined DataFrame with a new 'difference' column.

In [34]:
def compare_rentals(df1, df2):
    """
    Compare the number of rentals for two different months (provided as DataFrames).
    
    Paramenters:
    - df1 (DataFrame): DataFrame containing rental data for the first month
    - df2 (DataFrame): DataFrame containing rental data for the second month
    
    Returns:
    DataFrame: A new DataFrame containing the rental data for both months and the difference between them.
    """
    # Merge (Join) the two DataFrames on 'customer_id'
    comparison_df = pd.merge(df1, df2, on='customer_id', how='inner')
    
    # Calculate the difference between the two months
    comparison_df['difference'] = comparison_df.iloc[:, 1] - comparison_df.iloc[:, 2]
    
    return comparison_df

In [28]:
# Testing the function:
rental_comparison = compare_rentals(may_rental_counts, june_rental_counts)
rental_comparison.head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1                2                7          -5
1            2                1                1           0
2            3                2                4          -2
3            5                3                5          -2
4            6                3                4          -1